# Используем официальный образ Python как базовый образ
# Убедитесь, что версия соответствует вашей локальной, например, 3.10-slim-buster
FROM python:3.10-slim-buster

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей в рабочую директорию
COPY requirements.txt .

# Устанавливаем зависимости, используя pip
# --no-cache-dir: не кэшировать пакеты, чтобы уменьшить размер образа
# --upgrade pip: обновить pip до последней версии
RUN pip install --no-cache-dir --upgrade pip && \
    pip install --no-cache-dir -r requirements.txt

# Копируем все остальные файлы проекта в рабочую директорию контейнера
# .dockerignore файл будет исключать ненужные файлы (например, папку venv)
COPY . .

# Указываем команду, которая будет выполняться при запуске контейнера
# 'python' используется, так как внутри контейнера нет 'py.exe'
CMD ["python", "main.py"]